#Область ПрограммныйИнтерфейс 

//Добавление реквизита программно на форму документа
Процедура ДополнитьФорму(Форма) Экспорт
	
	// ++Гудилин Задача____ 20.02.2025
	Имяформы = Форма.Имяформы;
	
	Если Имяформы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма);
	КонецЕсли;
	// --Гудилин Задача____ 20.02.2025 
	
КонецПроцедуры 

#Конецобласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт
	
	// ++Гудилин Задача11-3 20.02.2025
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_КонтактноеЛицо";
	// --Гудилин Задача11-3 20.02.2025

КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма) Экспорт
	
	// ++Гудилин Задача11-3 20.02.2025
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_КонтактноеЛицо";
	// --Гудилин Задача11-3 20.02.2025

КонецПроцедуры

#Конецобласти